app/controllers/pages_controller.rb

SELECT "users".* FROM "users"
---
  def dashboard
    @users = User.all