app/controllers/posts_controller.rb

  def show
    @comments = Comment.all
---
SELECT "comments".* FROM "comments"

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Post"], ["content", "post"], ["user_id", 23], ["created_at", "2019-08-06 00:27:44.862358"], ["updated_at", "2019-08-06 00:27:44.862358"]]